---
kind: method
id: M:Autodesk.Revit.DB.Architecture.ContinuousRail.GetPath
source: html/ab18caf4-fa3d-8b66-899a-466834195045.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail.GetPath Method

Retrieves the rail path.

## Syntax (C#)
```csharp
public IList<Curve> GetPath()
```

## Returns
The path of the rail.